Scaniox/il-flatto/bootloader/re-linked/part_defs/atmega1284pdef.inc
;***** THIS IS A MACHINE GENERATED FILE - DO NOT EDIT ********************
;***** Created: 2011-02-09 12:03 ******* Source: ATmega1284P.xml *********
;*************************************************************************
;* A P P L I C A T I O N   N O T E   F O R   T H E   A V R   F A M I L Y
;* 
;* Number            : AVR000
;* File Name         : "m1284Pdef.inc"
;* Title             : Register/Bit Definitions for the ATmega1284P
;* Date              : 2011-02-09
;* Version           : 2.35
;* Support E-mail    : avr@atmel.com
;* Target MCU        : ATmega1284P
;* 
;* DESCRIPTION
;* When including this file in the assembly program file, all I/O register 
;* names and I/O register bit names appearing in the data book can be used.
;* In addition, the six registers forming the three data pointers X, Y and 
;* Z have been assigned names XL - ZH. Highest RAM address for Internal 
;* SRAM is also defined 
;* 
;* The Register names are represented by their hexadecimal address.
;* 
;* The Register Bit names are represented by their bit number (0-7).
;* 
;* Please observe the difference in using the bit names with instructions
;* such as "sbr"/"cbr" (set/clear bit in register) and "sbrs"/"sbrc"
;* (skip if bit in register set/cleared). The following example illustrates
;* this:
;* 
;* in    r16,PORTB             ;read PORTB latch
;* sbr   r16,(1<<PB6)+(1<<PB5) ;set PB6 and PB5 (use masks, not bit#)
;* out   PORTB,r16             ;output to PORTB
;* 
;* in    r16,TIFR              ;read the Timer Interrupt Flag Register
;* sbrc  r16,TOV0              ;test the overflow flag (use bit#)
;* rjmp  TOV0_is_set           ;jump if set
;* ...                         ;otherwise do something else
;*************************************************************************

#ifndef _M1284PDEF_INC_
#define _M1284PDEF_INC_


#pragma partinc 0

; ***** SPECIFY DEVICE ***************************************************
; .device ATmega1284P
#pragma AVRPART ADMIN PART_NAME ATmega1284P
.equ	SIGNATURE_000	, 0x1e
.equ	SIGNATURE_001	, 0x97
.equ	SIGNATURE_002	, 0x05

#pragma AVRPART CORE CORE_VERSION V2E


; ***** I/O REGISTER DEFINITIONS *****************************************
; NOTE:
; Definitions marked "MEMORY MAPPED"are extended I/O ports
; and cannot be used with IN/OUT instructions
.equ	UDR1	, 0xce	; MEMORY MAPPED
.equ	UBRR1L	, 0xcc	; MEMORY MAPPED
.equ	UBRR1H	, 0xcd	; MEMORY MAPPED
.equ	UCSR1C	, 0xca	; MEMORY MAPPED
.equ	UCSR1B	, 0xc9	; MEMORY MAPPED
.equ	UCSR1A	, 0xc8	; MEMORY MAPPED
.equ	UDR0	, 0xc6	; MEMORY MAPPED
.equ	UBRR0L	, 0xc4	; MEMORY MAPPED
.equ	UBRR0H	, 0xc5	; MEMORY MAPPED
.equ	UCSR0C	, 0xc2	; MEMORY MAPPED
.equ	UCSR0B	, 0xc1	; MEMORY MAPPED
.equ	UCSR0A	, 0xc0	; MEMORY MAPPED
.equ	TWAMR	, 0xbd	; MEMORY MAPPED
.equ	TWCR	, 0xbc	; MEMORY MAPPED
.equ	TWDR	, 0xbb	; MEMORY MAPPED
.equ	TWAR	, 0xba	; MEMORY MAPPED
.equ	TWSR	, 0xb9	; MEMORY MAPPED
.equ	TWBR	, 0xb8	; MEMORY MAPPED
.equ	ASSR	, 0xb6	; MEMORY MAPPED
.equ	OCR2B	, 0xb4	; MEMORY MAPPED
.equ	OCR2A	, 0xb3	; MEMORY MAPPED
.equ	TCNT2	, 0xb2	; MEMORY MAPPED
.equ	TCCR2B	, 0xb1	; MEMORY MAPPED
.equ	TCCR2A	, 0xb0	; MEMORY MAPPED
.equ	OCR3BL	, 0x9a	; MEMORY MAPPED
.equ	OCR3BH	, 0x9b	; MEMORY MAPPED
.equ	OCR3AL	, 0x98	; MEMORY MAPPED
.equ	OCR3AH	, 0x99	; MEMORY MAPPED
.equ	ICR3L	, 0x96	; MEMORY MAPPED
.equ	ICR3H	, 0x97	; MEMORY MAPPED
.equ	TCNT3L	, 0x94	; MEMORY MAPPED
.equ	TCNT3H	, 0x95	; MEMORY MAPPED
.equ	TCCR3C	, 0x92	; MEMORY MAPPED
.equ	TCCR3B	, 0x91	; MEMORY MAPPED
.equ	TCCR3A	, 0x90	; MEMORY MAPPED
.equ	OCR1BL	, 0x8a	; MEMORY MAPPED
.equ	OCR1BH	, 0x8b	; MEMORY MAPPED
.equ	OCR1AL	, 0x88	; MEMORY MAPPED
.equ	OCR1AH	, 0x89	; MEMORY MAPPED
.equ	ICR1L	, 0x86	; MEMORY MAPPED
.equ	ICR1H	, 0x87	; MEMORY MAPPED
.equ	TCNT1L	, 0x84	; MEMORY MAPPED
.equ	TCNT1H	, 0x85	; MEMORY MAPPED
.equ	TCCR1C	, 0x82	; MEMORY MAPPED
.equ	TCCR1B	, 0x81	; MEMORY MAPPED
.equ	TCCR1A	, 0x80	; MEMORY MAPPED
.equ	DIDR1	, 0x7f	; MEMORY MAPPED
.equ	DIDR0	, 0x7e	; MEMORY MAPPED
.equ	ADMUX	, 0x7c	; MEMORY MAPPED
.equ	ADCSRB	, 0x7b	; MEMORY MAPPED
.equ	ADCSRA	, 0x7a	; MEMORY MAPPED
.equ	ADCH	, 0x79	; MEMORY MAPPED
.equ	ADCL	, 0x78	; MEMORY MAPPED
.equ	PCMSK3	, 0x73	; MEMORY MAPPED
.equ	TIMSK3	, 0x71	; MEMORY MAPPED
.equ	TIMSK2	, 0x70	; MEMORY MAPPED
.equ	TIMSK1	, 0x6f	; MEMORY MAPPED
.equ	TIMSK0	, 0x6e	; MEMORY MAPPED
.equ	PCMSK2	, 0x6d	; MEMORY MAPPED
.equ	PCMSK1	, 0x6c	; MEMORY MAPPED
.equ	PCMSK0	, 0x6b	; MEMORY MAPPED
.equ	EICRA	, 0x69	; MEMORY MAPPED
.equ	PCICR	, 0x68	; MEMORY MAPPED
.equ	OSCCAL	, 0x66	; MEMORY MAPPED
.equ	PRR1	, 0x65	; MEMORY MAPPED
.equ	PRR0	, 0x64	; MEMORY MAPPED
.equ	CLKPR	, 0x61	; MEMORY MAPPED
.equ	WDTCSR	, 0x60	; MEMORY MAPPED
.equ	SREG	, 0x3f
.equ	SPL	, 0x3d
.equ	SPH	, 0x3e
.equ	RAMPZ	, 0x3b
.equ	SPMCSR	, 0x37
.equ	MCUCR	, 0x35
.equ	MCUSR	, 0x34
.equ	SMCR	, 0x33
.equ	OCDR	, 0x31
.equ	ACSR	, 0x30
.equ	SPDR	, 0x2e
.equ	SPSR	, 0x2d
.equ	SPCR	, 0x2c
.equ	GPIOR2	, 0x2b
.equ	GPIOR1	, 0x2a
.equ	OCR0B	, 0x28
.equ	OCR0A	, 0x27
.equ	TCNT0	, 0x26
.equ	TCCR0B	, 0x25
.equ	TCCR0A	, 0x24
.equ	GTCCR	, 0x23
.equ	EEARH	, 0x22
.equ	EEARL	, 0x21
.equ	EEDR	, 0x20
.equ	EECR	, 0x1f
.equ	GPIOR0	, 0x1e
.equ	EIMSK	, 0x1d
.equ	EIFR	, 0x1c
.equ	PCIFR	, 0x1b
.equ	TIFR3	, 0x18
.equ	TIFR2	, 0x17
.equ	TIFR1	, 0x16
.equ	TIFR0	, 0x15
.equ	PORTD	, 0x0b
.equ	DDRD	, 0x0a
.equ	PIND	, 0x09
.equ	PORTC	, 0x08
.equ	DDRC	, 0x07
.equ	PINC	, 0x06
.equ	PORTB	, 0x05
.equ	DDRB	, 0x04
.equ	PINB	, 0x03
.equ	PORTA	, 0x02
.equ	DDRA	, 0x01
.equ	PINA	, 0x00


; ***** BIT DEFINITIONS **************************************************

; ***** ANALOG_COMPARATOR ************
; ADCSRB - ADC Control and Status Register B
.equ	ACME	, 6	; Analog Comparator Multiplexer Enable

; ACSR - Analog Comparator Control And Status Register
.equ	ACIS0	, 0	; Analog Comparator Interrupt Mode Select bit 0
.equ	ACIS1	, 1	; Analog Comparator Interrupt Mode Select bit 1
.equ	ACIC	, 2	; Analog Comparator Input Capture Enable
.equ	ACIE	, 3	; Analog Comparator Interrupt Enable
.equ	ACI	, 4	; Analog Comparator Interrupt Flag
.equ	ACO	, 5	; Analog Compare Output
.equ	ACBG	, 6	; Analog Comparator Bandgap Select
.equ	ACD	, 7	; Analog Comparator Disable

