Scaniox/il-flatto/bootloader/re-linked/part_defs/atmega1284pdef.inc
; DIDR1 - Digital Input Disable Register 1
.equ	AIN0D	, 0	; AIN0 Digital Input Disable
.equ	AIN1D	, 1	; AIN1 Digital Input Disable


; ***** USART0 ***********************
; UDR0 - USART I/O Data Register
.equ	UDR0_0	, 0	; USART I/O Data Register bit 0
.equ	UDR0_1	, 1	; USART I/O Data Register bit 1
.equ	UDR0_2	, 2	; USART I/O Data Register bit 2
.equ	UDR0_3	, 3	; USART I/O Data Register bit 3
.equ	UDR0_4	, 4	; USART I/O Data Register bit 4
.equ	UDR0_5	, 5	; USART I/O Data Register bit 5
.equ	UDR0_6	, 6	; USART I/O Data Register bit 6
.equ	UDR0_7	, 7	; USART I/O Data Register bit 7

; UCSR0A - USART Control and Status Register A
.equ	MPCM0	, 0	; Multi-processor Communication Mode
.equ	U2X0	, 1	; Double the USART transmission speed
.equ	UPE0	, 2	; Parity Error
.equ	DOR0	, 3	; Data overRun
.equ	FE0	, 4	; Framing Error
.equ	UDRE0	, 5	; USART Data Register Empty
.equ	TXC0	, 6	; USART Transmitt Complete
.equ	RXC0	, 7	; USART Receive Complete

; UCSR0B - USART Control and Status Register B
.equ	TXB80	, 0	; Transmit Data Bit 8
.equ	RXB80	, 1	; Receive Data Bit 8
.equ	UCSZ02	, 2	; Character Size
.equ	TXEN0	, 3	; Transmitter Enable
.equ	RXEN0	, 4	; Receiver Enable
.equ	UDRIE0	, 5	; USART Data register Empty Interrupt Enable
.equ	TXCIE0	, 6	; TX Complete Interrupt Enable
.equ	RXCIE0	, 7	; RX Complete Interrupt Enable

; UCSR0C - USART Control and Status Register C
.equ	UCPOL0	, 0	; Clock Polarity
.equ	UCSZ00	, 1	; Character Size
.equ	UCPHA0	, UCSZ00	; For compatibility
.equ	UCSZ01	, 2	; Character Size
.equ	UDORD0	, UCSZ01	; For compatibility
.equ	USBS0	, 3	; Stop Bit Select
.equ	UPM00	, 4	; Parity Mode Bit 0
.equ	UPM01	, 5	; Parity Mode Bit 1
.equ	UMSEL00	, 6	; USART Mode Select
.equ	UMSEL0	, UMSEL00	; For compatibility
.equ	UMSEL01	, 7	; USART Mode Select
.equ	UMSEL1	, UMSEL01	; For compatibility

; UBRR0H - USART Baud Rate Register High Byte
.equ	UBRR8	, 0	; USART Baud Rate Register bit 8
.equ	UBRR9	, 1	; USART Baud Rate Register bit 9
.equ	UBRR10	, 2	; USART Baud Rate Register bit 10
.equ	UBRR11	, 3	; USART Baud Rate Register bit 11

; UBRR0L - USART Baud Rate Register Low Byte
.equ	_UBRR0	, 0	; USART Baud Rate Register bit 0
.equ	_UBRR1	, 1	; USART Baud Rate Register bit 1
.equ	UBRR2	, 2	; USART Baud Rate Register bit 2
.equ	UBRR3	, 3	; USART Baud Rate Register bit 3
.equ	UBRR4	, 4	; USART Baud Rate Register bit 4
.equ	UBRR5	, 5	; USART Baud Rate Register bit 5
.equ	UBRR6	, 6	; USART Baud Rate Register bit 6
.equ	UBRR7	, 7	; USART Baud Rate Register bit 7


; ***** PORTA ************************
; PORTA - Port A Data Register
.equ	PORTA0	, 0	; Port A Data Register bit 0
.equ	PA0	, 0	; For compatibility
.equ	PORTA1	, 1	; Port A Data Register bit 1
.equ	PA1	, 1	; For compatibility
.equ	PORTA2	, 2	; Port A Data Register bit 2
.equ	PA2	, 2	; For compatibility
.equ	PORTA3	, 3	; Port A Data Register bit 3
.equ	PA3	, 3	; For compatibility
.equ	PORTA4	, 4	; Port A Data Register bit 4
.equ	PA4	, 4	; For compatibility
.equ	PORTA5	, 5	; Port A Data Register bit 5
.equ	PA5	, 5	; For compatibility
.equ	PORTA6	, 6	; Port A Data Register bit 6
.equ	PA6	, 6	; For compatibility
.equ	PORTA7	, 7	; Port A Data Register bit 7
.equ	PA7	, 7	; For compatibility

; DDRA - Port A Data Direction Register
.equ	DDA0	, 0	; Data Direction Register, Port A, bit 0
.equ	DDA1	, 1	; Data Direction Register, Port A, bit 1
.equ	DDA2	, 2	; Data Direction Register, Port A, bit 2
.equ	DDA3	, 3	; Data Direction Register, Port A, bit 3
.equ	DDA4	, 4	; Data Direction Register, Port A, bit 4
.equ	DDA5	, 5	; Data Direction Register, Port A, bit 5
.equ	DDA6	, 6	; Data Direction Register, Port A, bit 6
.equ	DDA7	, 7	; Data Direction Register, Port A, bit 7

; PINA - Port A Input Pins
.equ	PINA0	, 0	; Input Pins, Port A bit 0
.equ	PINA1	, 1	; Input Pins, Port A bit 1
.equ	PINA2	, 2	; Input Pins, Port A bit 2
.equ	PINA3	, 3	; Input Pins, Port A bit 3
.equ	PINA4	, 4	; Input Pins, Port A bit 4
.equ	PINA5	, 5	; Input Pins, Port A bit 5
.equ	PINA6	, 6	; Input Pins, Port A bit 6
.equ	PINA7	, 7	; Input Pins, Port A bit 7


; ***** PORTB ************************
; PORTB - Port B Data Register
.equ	PORTB0	, 0	; Port B Data Register bit 0
.equ	PB0	, 0	; For compatibility
.equ	PORTB1	, 1	; Port B Data Register bit 1
.equ	PB1	, 1	; For compatibility
.equ	PORTB2	, 2	; Port B Data Register bit 2
.equ	PB2	, 2	; For compatibility
.equ	PORTB3	, 3	; Port B Data Register bit 3
.equ	PB3	, 3	; For compatibility
.equ	PORTB4	, 4	; Port B Data Register bit 4
.equ	PB4	, 4	; For compatibility
.equ	PORTB5	, 5	; Port B Data Register bit 5
.equ	PB5	, 5	; For compatibility
.equ	PORTB6	, 6	; Port B Data Register bit 6
.equ	PB6	, 6	; For compatibility
.equ	PORTB7	, 7	; Port B Data Register bit 7
.equ	PB7	, 7	; For compatibility

; DDRB - Port B Data Direction Register
.equ	DDB0	, 0	; Port B Data Direction Register bit 0
.equ	DDB1	, 1	; Port B Data Direction Register bit 1
.equ	DDB2	, 2	; Port B Data Direction Register bit 2
.equ	DDB3	, 3	; Port B Data Direction Register bit 3
.equ	DDB4	, 4	; Port B Data Direction Register bit 4
.equ	DDB5	, 5	; Port B Data Direction Register bit 5
.equ	DDB6	, 6	; Port B Data Direction Register bit 6
.equ	DDB7	, 7	; Port B Data Direction Register bit 7

; PINB - Port B Input Pins
.equ	PINB0	, 0	; Port B Input Pins bit 0
.equ	PINB1	, 1	; Port B Input Pins bit 1
.equ	PINB2	, 2	; Port B Input Pins bit 2
.equ	PINB3	, 3	; Port B Input Pins bit 3
.equ	PINB4	, 4	; Port B Input Pins bit 4
.equ	PINB5	, 5	; Port B Input Pins bit 5
.equ	PINB6	, 6	; Port B Input Pins bit 6
.equ	PINB7	, 7	; Port B Input Pins bit 7


; ***** PORTC ************************
; PORTC - Port C Data Register
.equ	PORTC0	, 0	; Port C Data Register bit 0
.equ	PC0	, 0	; For compatibility
.equ	PORTC1	, 1	; Port C Data Register bit 1
.equ	PC1	, 1	; For compatibility
.equ	PORTC2	, 2	; Port C Data Register bit 2
.equ	PC2	, 2	; For compatibility
.equ	PORTC3	, 3	; Port C Data Register bit 3
.equ	PC3	, 3	; For compatibility
.equ	PORTC4	, 4	; Port C Data Register bit 4
.equ	PC4	, 4	; For compatibility
.equ	PORTC5	, 5	; Port C Data Register bit 5
.equ	PC5	, 5	; For compatibility
.equ	PORTC6	, 6	; Port C Data Register bit 6
.equ	PC6	, 6	; For compatibility
.equ	PORTC7	, 7	; Port C Data Register bit 7
.equ	PC7	, 7	; For compatibility

