Scaniox/il-flatto/bootloader/re-linked/part_defs/atmega1284pdef.inc
; DDRC - Port C Data Direction Register
.equ	DDC0	, 0	; Port C Data Direction Register bit 0
.equ	DDC1	, 1	; Port C Data Direction Register bit 1
.equ	DDC2	, 2	; Port C Data Direction Register bit 2
.equ	DDC3	, 3	; Port C Data Direction Register bit 3
.equ	DDC4	, 4	; Port C Data Direction Register bit 4
.equ	DDC5	, 5	; Port C Data Direction Register bit 5
.equ	DDC6	, 6	; Port C Data Direction Register bit 6
.equ	DDC7	, 7	; Port C Data Direction Register bit 7

; PINC - Port C Input Pins
.equ	PINC0	, 0	; Port C Input Pins bit 0
.equ	PINC1	, 1	; Port C Input Pins bit 1
.equ	PINC2	, 2	; Port C Input Pins bit 2
.equ	PINC3	, 3	; Port C Input Pins bit 3
.equ	PINC4	, 4	; Port C Input Pins bit 4
.equ	PINC5	, 5	; Port C Input Pins bit 5
.equ	PINC6	, 6	; Port C Input Pins bit 6
.equ	PINC7	, 7	; Port C Input Pins bit 7


; ***** PORTD ************************
; PORTD - Port D Data Register
.equ	PORTD0	, 0	; Port D Data Register bit 0
.equ	PD0	, 0	; For compatibility
.equ	PORTD1	, 1	; Port D Data Register bit 1
.equ	PD1	, 1	; For compatibility
.equ	PORTD2	, 2	; Port D Data Register bit 2
.equ	PD2	, 2	; For compatibility
.equ	PORTD3	, 3	; Port D Data Register bit 3
.equ	PD3	, 3	; For compatibility
.equ	PORTD4	, 4	; Port D Data Register bit 4
.equ	PD4	, 4	; For compatibility
.equ	PORTD5	, 5	; Port D Data Register bit 5
.equ	PD5	, 5	; For compatibility
.equ	PORTD6	, 6	; Port D Data Register bit 6
.equ	PD6	, 6	; For compatibility
.equ	PORTD7	, 7	; Port D Data Register bit 7
.equ	PD7	, 7	; For compatibility

; DDRD - Port D Data Direction Register
.equ	DDD0	, 0	; Port D Data Direction Register bit 0
.equ	DDD1	, 1	; Port D Data Direction Register bit 1
.equ	DDD2	, 2	; Port D Data Direction Register bit 2
.equ	DDD3	, 3	; Port D Data Direction Register bit 3
.equ	DDD4	, 4	; Port D Data Direction Register bit 4
.equ	DDD5	, 5	; Port D Data Direction Register bit 5
.equ	DDD6	, 6	; Port D Data Direction Register bit 6
.equ	DDD7	, 7	; Port D Data Direction Register bit 7

; PIND - Port D Input Pins
.equ	PIND0	, 0	; Port D Input Pins bit 0
.equ	PIND1	, 1	; Port D Input Pins bit 1
.equ	PIND2	, 2	; Port D Input Pins bit 2
.equ	PIND3	, 3	; Port D Input Pins bit 3
.equ	PIND4	, 4	; Port D Input Pins bit 4
.equ	PIND5	, 5	; Port D Input Pins bit 5
.equ	PIND6	, 6	; Port D Input Pins bit 6
.equ	PIND7	, 7	; Port D Input Pins bit 7


; ***** TIMER_COUNTER_0 **************
; TIMSK0 - Timer/Counter0 Interrupt Mask Register
.equ	TOIE0	, 0	; Timer/Counter0 Overflow Interrupt Enable
.equ	OCIE0A	, 1	; Timer/Counter0 Output Compare Match A Interrupt Enable
.equ	OCIE0B	, 2	; Timer/Counter0 Output Compare Match B Interrupt Enable

; TIFR0 - Timer/Counter0 Interrupt Flag register
.equ	TOV0	, 0	; Timer/Counter0 Overflow Flag
.equ	OCF0A	, 1	; Timer/Counter0 Output Compare Flag 0A
.equ	OCF0B	, 2	; Timer/Counter0 Output Compare Flag 0B

; TCCR0A - Timer/Counter  Control Register A
.equ	WGM00	, 0	; Waveform Generation Mode
.equ	WGM01	, 1	; Waveform Generation Mode
.equ	COM0B0	, 4	; Compare Output Mode, Fast PWm
.equ	COM0B1	, 5	; Compare Output Mode, Fast PWm
.equ	COM0A0	, 6	; Compare Output Mode, Phase Correct PWM Mode
.equ	COM0A1	, 7	; Compare Output Mode, Phase Correct PWM Mode

; TCCR0B - Timer/Counter Control Register B
.equ	CS00	, 0	; Clock Select
.equ	CS01	, 1	; Clock Select
.equ	CS02	, 2	; Clock Select
.equ	WGM02	, 3	; 
.equ	FOC0B	, 6	; Force Output Compare B
.equ	FOC0A	, 7	; Force Output Compare A

; TCNT0 - Timer/Counter0
.equ	TCNT0_0	, 0	; 
.equ	TCNT0_1	, 1	; 
.equ	TCNT0_2	, 2	; 
.equ	TCNT0_3	, 3	; 
.equ	TCNT0_4	, 4	; 
.equ	TCNT0_5	, 5	; 
.equ	TCNT0_6	, 6	; 
.equ	TCNT0_7	, 7	; 

; OCR0A - Timer/Counter0 Output Compare Register
.equ	OCR0A_0	, 0	; 
.equ	OCR0A_1	, 1	; 
.equ	OCR0A_2	, 2	; 
.equ	OCR0A_3	, 3	; 
.equ	OCR0A_4	, 4	; 
.equ	OCR0A_5	, 5	; 
.equ	OCR0A_6	, 6	; 
.equ	OCR0A_7	, 7	; 

; OCR0B - Timer/Counter0 Output Compare Register
.equ	OCR0B_0	, 0	; 
.equ	OCR0B_1	, 1	; 
.equ	OCR0B_2	, 2	; 
.equ	OCR0B_3	, 3	; 
.equ	OCR0B_4	, 4	; 
.equ	OCR0B_5	, 5	; 
.equ	OCR0B_6	, 6	; 
.equ	OCR0B_7	, 7	; 

; GTCCR - General Timer/Counter Control Register
.equ	PSRSYNC	, 0	; Prescaler Reset Timer/Counter1 and Timer/Counter0
.equ	PSR10	, PSRSYNC	; For compatibility
.equ	TSM	, 7	; Timer/Counter Synchronization Mode


; ***** TIMER_COUNTER_1 **************
; TIMSK1 - Timer/Counter1 Interrupt Mask Register
.equ	TOIE1	, 0	; Timer/Counter1 Overflow Interrupt Enable
.equ	OCIE1A	, 1	; Timer/Counter1 Output Compare A Match Interrupt Enable
.equ	OCIE1B	, 2	; Timer/Counter1 Output Compare B Match Interrupt Enable
.equ	ICIE1	, 5	; Timer/Counter1 Input Capture Interrupt Enable

; TIFR1 - Timer/Counter Interrupt Flag register
.equ	TOV1	, 0	; Timer/Counter1 Overflow Flag
.equ	OCF1A	, 1	; Timer/Counter1 Output Compare A Match Flag
.equ	OCF1B	, 2	; Timer/Counter1 Output Compare B Match Flag
.equ	ICF1	, 5	; Timer/Counter1 Input Capture Flag

; TCCR1A - Timer/Counter1 Control Register A
.equ	WGM10	, 0	; Pulse Width Modulator Select Bit 0
.equ	PWM10	, WGM10	; For compatibility
.equ	WGM11	, 1	; Pulse Width Modulator Select Bit 1
.equ	PWM11	, WGM11	; For compatibility
.equ	COM1B0	, 4	; Comparet Ouput Mode 1B, bit 0
.equ	COM1B1	, 5	; Compare Output Mode 1B, bit 1
.equ	COM1A0	, 6	; Comparet Ouput Mode 1A, bit 0
.equ	COM1A1	, 7	; Compare Output Mode 1A, bit 1

; TCCR1B - Timer/Counter1 Control Register B
.equ	CS10	, 0	; Clock Select bit 0
.equ	CS11	, 1	; Clock Select 1 bit 1
.equ	CS12	, 2	; Clock Select1 bit 2
.equ	WGM12	, 3	; Waveform Generation Mode Bit 2
.equ	CTC1	, WGM12	; For compatibility
.equ	WGM13	, 4	; Waveform Generation Mode Bit 3
.equ	ICES1	, 6	; Input Capture 1 Edge Select
.equ	ICNC1	, 7	; Input Capture 1 Noise Canceler

; TCCR1C - Timer/Counter1 Control Register C
.equ	FOC1B	, 6	; Force Output Compare for Channel B
.equ	FOC1A	, 7	; Force Output Compare for Channel A


; ***** TIMER_COUNTER_2 **************
; TIMSK2 - Timer/Counter Interrupt Mask register
.equ	TOIE2	, 0	; Timer/Counter2 Overflow Interrupt Enable
.equ	TOIE2A	, TOIE2	; For compatibility
.equ	OCIE2A	, 1	; Timer/Counter2 Output Compare Match A Interrupt Enable
.equ	OCIE2B	, 2	; Timer/Counter2 Output Compare Match B Interrupt Enable

; TIFR2 - Timer/Counter Interrupt Flag Register
.equ	TOV2	, 0	; Timer/Counter2 Overflow Flag
.equ	OCF2A	, 1	; Output Compare Flag 2A
.equ	OCF2B	, 2	; Output Compare Flag 2B

; TCCR2A - Timer/Counter2 Control Register A
.equ	WGM20	, 0	; Waveform Genration Mode
.equ	WGM21	, 1	; Waveform Genration Mode
.equ	COM2B0	, 4	; Compare Output Mode bit 0
.equ	COM2B1	, 5	; Compare Output Mode bit 1
.equ	COM2A0	, 6	; Compare Output Mode bit 1
.equ	COM2A1	, 7	; Compare Output Mode bit 1

