Scaniox/il-flatto/bootloader/re-linked/part_defs/atmega1284pdef.inc
; TCCR2B - Timer/Counter2 Control Register B
.equ	CS20	, 0	; Clock Select bit 0
.equ	CS21	, 1	; Clock Select bit 1
.equ	CS22	, 2	; Clock Select bit 2
.equ	WGM22	, 3	; Waveform Generation Mode
.equ	FOC2B	, 6	; Force Output Compare B
.equ	FOC2A	, 7	; Force Output Compare A

; TCNT2 - Timer/Counter2
.equ	TCNT2_0	, 0	; Timer/Counter 2 bit 0
.equ	TCNT2_1	, 1	; Timer/Counter 2 bit 1
.equ	TCNT2_2	, 2	; Timer/Counter 2 bit 2
.equ	TCNT2_3	, 3	; Timer/Counter 2 bit 3
.equ	TCNT2_4	, 4	; Timer/Counter 2 bit 4
.equ	TCNT2_5	, 5	; Timer/Counter 2 bit 5
.equ	TCNT2_6	, 6	; Timer/Counter 2 bit 6
.equ	TCNT2_7	, 7	; Timer/Counter 2 bit 7

; OCR2A - Timer/Counter2 Output Compare Register A
.equ	OCR2A_0	, 0	; Timer/Counter2 Output Compare Register Bit 0
.equ	OCR2A_1	, 1	; Timer/Counter2 Output Compare Register Bit 1
.equ	OCR2A_2	, 2	; Timer/Counter2 Output Compare Register Bit 2
.equ	OCR2A_3	, 3	; Timer/Counter2 Output Compare Register Bit 3
.equ	OCR2A_4	, 4	; Timer/Counter2 Output Compare Register Bit 4
.equ	OCR2A_5	, 5	; Timer/Counter2 Output Compare Register Bit 5
.equ	OCR2A_6	, 6	; Timer/Counter2 Output Compare Register Bit 6
.equ	OCR2A_7	, 7	; Timer/Counter2 Output Compare Register Bit 7

; OCR2B - Timer/Counter2 Output Compare Register B
.equ	OCR2B_0	, 0	; Timer/Counter2 Output Compare Register Bit 0
.equ	OCR2B_1	, 1	; Timer/Counter2 Output Compare Register Bit 1
.equ	OCR2B_2	, 2	; Timer/Counter2 Output Compare Register Bit 2
.equ	OCR2B_3	, 3	; Timer/Counter2 Output Compare Register Bit 3
.equ	OCR2B_4	, 4	; Timer/Counter2 Output Compare Register Bit 4
.equ	OCR2B_5	, 5	; Timer/Counter2 Output Compare Register Bit 5
.equ	OCR2B_6	, 6	; Timer/Counter2 Output Compare Register Bit 6
.equ	OCR2B_7	, 7	; Timer/Counter2 Output Compare Register Bit 7

; ASSR - Asynchronous Status Register
.equ	TCR2BUB	, 0	; Timer/Counter Control Register2 Update Busy
.equ	TCR2AUB	, 1	; Timer/Counter Control Register2 Update Busy
.equ	OCR2BUB	, 2	; Output Compare Register 2 Update Busy
.equ	OCR2AUB	, 3	; Output Compare Register2 Update Busy
.equ	TCN2UB	, 4	; Timer/Counter2 Update Busy
.equ	AS2	, 5	; Asynchronous Timer/Counter2
.equ	EXCLK	, 6	; Enable External Clock Input

; GTCCR - General Timer Counter Control register
.equ	PSRASY	, 1	; Prescaler Reset Timer/Counter2
.equ	PSR2	, PSRASY	; For compatibility
;.equ	TSM	, 7	; Timer/Counter Synchronization Mode


; ***** TIMER_COUNTER_3 **************
; TIMSK3 - Timer/Counter3 Interrupt Mask Register
.equ	TOIE3	, 0	; Timer/Counter3 Overflow Interrupt Enable
.equ	OCIE3A	, 1	; Timer/Counter3 Output Compare A Match Interrupt Enable
.equ	OCIE3B	, 2	; Timer/Counter3 Output Compare B Match Interrupt Enable
.equ	ICIE3	, 5	; Timer/Counter3 Input Capture Interrupt Enable

; TIFR3 - Timer/Counter Interrupt Flag register
.equ	TOV3	, 0	; Timer/Counter3 Overflow Flag
.equ	OCF3A	, 1	; Timer/Counter3 Output Compare A Match Flag
.equ	OCF3B	, 2	; Timer/Counter3 Output Compare B Match Flag
.equ	ICF3	, 5	; Timer/Counter3 Input Capture Flag

; TCCR3A - Timer/Counter3 Control Register A
.equ	WGM30	, 0	; Pulse Width Modulator Select Bit 0
.equ	WGM31	, 1	; Pulse Width Modulator Select Bit 1
.equ	COM3B0	, 4	; Comparet Ouput Mode 3B, bit 0
.equ	COM3B1	, 5	; Compare Output Mode 3B, bit 1
.equ	COM3A0	, 6	; Comparet Ouput Mode 3A, bit 0
.equ	COM3A1	, 7	; Compare Output Mode 3A, bit 1

; TCCR3B - Timer/Counter3 Control Register B
.equ	CS30	, 0	; Clock Select bit 0
.equ	CS31	, 1	; Clock Select 3 bit 1
.equ	CS32	, 2	; Clock Select3 bit 2
.equ	WGM32	, 3	; Waveform Generation Mode Bit 2
.equ	WGM33	, 4	; Waveform Generation Mode Bit 3
.equ	ICES3	, 6	; Input Capture 3 Edge Select
.equ	ICNC3	, 7	; Input Capture 3 Noise Canceler

; TCCR3C - Timer/Counter3 Control Register C
.equ	FOC3B	, 6	; Force Output Compare for Channel B
.equ	FOC3A	, 7	; Force Output Compare for Channel A

; OCR3BH - Timer/Counter3 Output Compare Register B High Byte
.equ	OCR3AH0	, 0	; Timer/Counter3 Output Compare Register High Byte bit 0
.equ	OCR3AH1	, 1	; Timer/Counter3 Output Compare Register High Byte bit 1
.equ	OCR3AH2	, 2	; Timer/Counter3 Output Compare Register High Byte bit 2
.equ	OCR3AH3	, 3	; Timer/Counter3 Output Compare Register High Byte bit 3
.equ	OCR3AH4	, 4	; Timer/Counter3 Output Compare Register High Byte bit 4
.equ	OCR3AH5	, 5	; Timer/Counter3 Output Compare Register High Byte bit 5
.equ	OCR3AH6	, 6	; Timer/Counter3 Output Compare Register High Byte bit 6
.equ	OCR3AH7	, 7	; Timer/Counter3 Output Compare Register High Byte bit 7

; OCR3BL - Timer/Counter3 Output Compare Register B Low Byte
.equ	OCR3AL0	, 0	; Timer/Counter3 Output Compare Register Low Byte Bit 0
.equ	OCR3AL1	, 1	; Timer/Counter3 Output Compare Register Low Byte Bit 1
.equ	OCR3AL2	, 2	; Timer/Counter3 Output Compare Register Low Byte Bit 2
.equ	OCR3AL3	, 3	; Timer/Counter3 Output Compare Register Low Byte Bit 3
.equ	OCR3AL4	, 4	; Timer/Counter3 Output Compare Register Low Byte Bit 4
.equ	OCR3AL5	, 5	; Timer/Counter3 Output Compare Register Low Byte Bit 5
.equ	OCR3AL6	, 6	; Timer/Counter3 Output Compare Register Low Byte Bit 6
.equ	OCR3AL7	, 7	; Timer/Counter3 Output Compare Register Low Byte Bit 7


; ***** BOOT_LOAD ********************
; SPMCSR - Store Program Memory Control Register
.equ	SPMEN	, 0	; Store Program Memory Enable
.equ	PGERS	, 1	; Page Erase
.equ	PGWRT	, 2	; Page Write
.equ	BLBSET	, 3	; Boot Lock Bit Set
.equ	RWWSRE	, 4	; Read While Write section read enable
.equ	SIGRD	, 5	; Signature Row Read
.equ	RWWSB	, 6	; Read While Write Section Busy
.equ	SPMIE	, 7	; SPM Interrupt Enable


; ***** EXTERNAL_INTERRUPT ***********
; EICRA - External Interrupt Control Register A
.equ	ISC00	, 0	; External Interrupt Sense Control Bit
.equ	ISC01	, 1	; External Interrupt Sense Control Bit
.equ	ISC10	, 2	; External Interrupt Sense Control Bit
.equ	ISC11	, 3	; External Interrupt Sense Control Bit
.equ	ISC20	, 4	; External Interrupt Sense Control Bit
.equ	ISC21	, 5	; External Interrupt Sense Control Bit

; EIMSK - External Interrupt Mask Register
.equ	INT0	, 0	; External Interrupt Request 0 Enable
.equ	INT1	, 1	; External Interrupt Request 1 Enable
.equ	INT2	, 2	; External Interrupt Request 2 Enable

; EIFR - External Interrupt Flag Register
.equ	INTF0	, 0	; External Interrupt Flag 0
.equ	INTF1	, 1	; External Interrupt Flag 1
.equ	INTF2	, 2	; External Interrupt Flag 2

; PCICR - Pin Change Interrupt Control Register
.equ	PCIE0	, 0	; Pin Change Interrupt Enable 0
.equ	PCIE1	, 1	; Pin Change Interrupt Enable 1
.equ	PCIE2	, 2	; Pin Change Interrupt Enable 2
.equ	PCIE3	, 3	; Pin Change Interrupt Enable 3

; PCIFR - Pin Change Interrupt Flag Register
.equ	PCIF0	, 0	; Pin Change Interrupt Flag 0
.equ	PCIF1	, 1	; Pin Change Interrupt Flag 1
.equ	PCIF2	, 2	; Pin Change Interrupt Flag 2
.equ	PCIF3	, 3	; Pin Change Interrupt Flag 3

; PCMSK3 - Pin Change Mask Register 3
.equ	PCINT24	, 0	; Pin Change Enable Mask 24
.equ	PCINT25	, 1	; Pin Change Enable Mask 25
.equ	PCINT26	, 2	; Pin Change Enable Mask 26
.equ	PCINT27	, 3	; Pin Change Enable Mask 27
.equ	PCINT28	, 4	; Pin Change Enable Mask 28
.equ	PCINT29	, 5	; Pin Change Enable Mask 29
.equ	PCINT30	, 6	; Pin Change Enable Mask 30
.equ	PCINT31	, 7	; Pin Change Enable Mask 31

; PCMSK2 - Pin Change Mask Register 2
.equ	PCINT16	, 0	; Pin Change Enable Mask 16
.equ	PCINT17	, 1	; Pin Change Enable Mask 17
.equ	PCINT18	, 2	; Pin Change Enable Mask 18
.equ	PCINT19	, 3	; Pin Change Enable Mask 19
.equ	PCINT20	, 4	; Pin Change Enable Mask 20
.equ	PCINT21	, 5	; Pin Change Enable Mask 21
.equ	PCINT22	, 6	; Pin Change Enable Mask 22
.equ	PCINT23	, 7	; Pin Change Enable Mask 23

; PCMSK1 - Pin Change Mask Register 1
.equ	PCINT8	, 0	; Pin Change Enable Mask 8
.equ	PCINT9	, 1	; Pin Change Enable Mask 9
.equ	PCINT10	, 2	; Pin Change Enable Mask 10
.equ	PCINT11	, 3	; Pin Change Enable Mask 11
.equ	PCINT12	, 4	; Pin Change Enable Mask 12
.equ	PCINT13	, 5	; Pin Change Enable Mask 13
.equ	PCINT14	, 6	; Pin Change Enable Mask 14
.equ	PCINT15	, 7	; Pin Change Enable Mask 15

; PCMSK0 - Pin Change Mask Register 0
.equ	PCINT0	, 0	; Pin Change Enable Mask 0
.equ	PCINT1	, 1	; Pin Change Enable Mask 1
.equ	PCINT2	, 2	; Pin Change Enable Mask 2
.equ	PCINT3	, 3	; Pin Change Enable Mask 3
.equ	PCINT4	, 4	; Pin Change Enable Mask 4
.equ	PCINT5	, 5	; Pin Change Enable Mask 5
.equ	PCINT6	, 6	; Pin Change Enable Mask 6
.equ	PCINT7	, 7	; Pin Change Enable Mask 7


; ***** AD_CONVERTER *****************
; ADMUX - The ADC multiplexer Selection Register
.equ	MUX0	, 0	; Analog Channel and Gain Selection Bits
.equ	MUX1	, 1	; Analog Channel and Gain Selection Bits
.equ	MUX2	, 2	; Analog Channel and Gain Selection Bits
.equ	MUX3	, 3	; Analog Channel and Gain Selection Bits
.equ	MUX4	, 4	; Analog Channel and Gain Selection Bits
.equ	ADLAR	, 5	; Left Adjust Result
.equ	REFS0	, 6	; Reference Selection Bit 0
.equ	REFS1	, 7	; Reference Selection Bit 1

; ADCSRA - The ADC Control and Status register A
.equ	ADPS0	, 0	; ADC  Prescaler Select Bits
.equ	ADPS1	, 1	; ADC  Prescaler Select Bits
.equ	ADPS2	, 2	; ADC  Prescaler Select Bits
.equ	ADIE	, 3	; ADC Interrupt Enable
.equ	ADIF	, 4	; ADC Interrupt Flag
.equ	ADATE	, 5	; ADC  Auto Trigger Enable
.equ	ADSC	, 6	; ADC Start Conversion
.equ	ADEN	, 7	; ADC Enable

; ADCSRB - The ADC Control and Status register B
.equ	ADTS0	, 0	; ADC Auto Trigger Source bit 0
.equ	ADTS1	, 1	; ADC Auto Trigger Source bit 1
.equ	ADTS2	, 2	; ADC Auto Trigger Source bit 2
;.equ	ACME	, 6	; 

; ADCH - ADC Data Register High Byte
.equ	ADCH0	, 0	; ADC Data Register High Byte Bit 0
.equ	ADCH1	, 1	; ADC Data Register High Byte Bit 1
.equ	ADCH2	, 2	; ADC Data Register High Byte Bit 2
.equ	ADCH3	, 3	; ADC Data Register High Byte Bit 3
.equ	ADCH4	, 4	; ADC Data Register High Byte Bit 4
.equ	ADCH5	, 5	; ADC Data Register High Byte Bit 5
.equ	ADCH6	, 6	; ADC Data Register High Byte Bit 6
.equ	ADCH7	, 7	; ADC Data Register High Byte Bit 7

; ADCL - ADC Data Register Low Byte
.equ	ADCL0	, 0	; ADC Data Register Low Byte Bit 0
.equ	ADCL1	, 1	; ADC Data Register Low Byte Bit 1
.equ	ADCL2	, 2	; ADC Data Register Low Byte Bit 2
.equ	ADCL3	, 3	; ADC Data Register Low Byte Bit 3
.equ	ADCL4	, 4	; ADC Data Register Low Byte Bit 4
.equ	ADCL5	, 5	; ADC Data Register Low Byte Bit 5
.equ	ADCL6	, 6	; ADC Data Register Low Byte Bit 6
.equ	ADCL7	, 7	; ADC Data Register Low Byte Bit 7

; DIDR0 - Digital Input Disable Register
.equ	ADC0D	, 0	; 
.equ	ADC1D	, 1	; 
.equ	ADC2D	, 2	; 
.equ	ADC3D	, 3	; 
.equ	ADC4D	, 4	; 
.equ	ADC5D	, 5	; 
.equ	ADC6D	, 6	; 
.equ	ADC7D	, 7	; 


