Scaniox/il-flatto/bootloader/re-linked/part_defs/atmega1284pdef.inc
; ***** JTAG *************************
; OCDR - On-Chip Debug Related Register in I/O Memory
.equ	OCDR0	, 0	; On-Chip Debug Register Bit 0
.equ	OCDR1	, 1	; On-Chip Debug Register Bit 1
.equ	OCDR2	, 2	; On-Chip Debug Register Bit 2
.equ	OCDR3	, 3	; On-Chip Debug Register Bit 3
.equ	OCDR4	, 4	; On-Chip Debug Register Bit 4
.equ	OCDR5	, 5	; On-Chip Debug Register Bit 5
.equ	OCDR6	, 6	; On-Chip Debug Register Bit 6
.equ	OCDR7	, 7	; On-Chip Debug Register Bit 7
.equ	IDRD	, OCDR7	; For compatibility

; MCUCR - MCU Control Register
.equ	JTD	, 7	; JTAG Interface Disable

; MCUSR - MCU Status Register
.equ	JTRF	, 4	; JTAG Reset Flag


; ***** EEPROM ***********************
; EEARH - EEPROM Address Register Low Byte
.equ	EEAR8	, 0	; EEPROM Read/Write Access Bit 8
.equ	EEAR9	, 1	; EEPROM Read/Write Access Bit 9
.equ	EEAR10	, 2	; EEPROM Read/Write Access Bit 10
.equ	EEAR11	, 3	; EEPROM Read/Write Access Bit 11

; EEARL - EEPROM Address Register Low Byte
.equ	EEAR0	, 0	; EEPROM Read/Write Access Bit 0
.equ	EEAR1	, 1	; EEPROM Read/Write Access Bit 1
.equ	EEAR2	, 2	; EEPROM Read/Write Access Bit 2
.equ	EEAR3	, 3	; EEPROM Read/Write Access Bit 3
.equ	EEAR4	, 4	; EEPROM Read/Write Access Bit 4
.equ	EEAR5	, 5	; EEPROM Read/Write Access Bit 5
.equ	EEAR6	, 6	; EEPROM Read/Write Access Bit 6
.equ	EEAR7	, 7	; EEPROM Read/Write Access Bit 7

; EEDR - EEPROM Data Register
.equ	EEDR0	, 0	; EEPROM Data Register bit 0
.equ	EEDR1	, 1	; EEPROM Data Register bit 1
.equ	EEDR2	, 2	; EEPROM Data Register bit 2
.equ	EEDR3	, 3	; EEPROM Data Register bit 3
.equ	EEDR4	, 4	; EEPROM Data Register bit 4
.equ	EEDR5	, 5	; EEPROM Data Register bit 5
.equ	EEDR6	, 6	; EEPROM Data Register bit 6
.equ	EEDR7	, 7	; EEPROM Data Register bit 7

; EECR - EEPROM Control Register
.equ	EERE	, 0	; EEPROM Read Enable
.equ	EEPE	, 1	; EEPROM Write Enable
.equ	EEMPE	, 2	; EEPROM Master Write Enable
.equ	EERIE	, 3	; EEPROM Ready Interrupt Enable
.equ	EEPM0	, 4	; EEPROM Programming Mode Bit 0
.equ	EEPM1	, 5	; EEPROM Programming Mode Bit 1


; ***** TWI **************************
; TWAMR - TWI (Slave) Address Mask Register
.equ	TWAM0	, 1	; 
.equ	TWAMR0	, TWAM0	; For compatibility
.equ	TWAM1	, 2	; 
.equ	TWAMR1	, TWAM1	; For compatibility
.equ	TWAM2	, 3	; 
.equ	TWAMR2	, TWAM2	; For compatibility
.equ	TWAM3	, 4	; 
.equ	TWAMR3	, TWAM3	; For compatibility
.equ	TWAM4	, 5	; 
.equ	TWAMR4	, TWAM4	; For compatibility
.equ	TWAM5	, 6	; 
.equ	TWAMR5	, TWAM5	; For compatibility
.equ	TWAM6	, 7	; 
.equ	TWAMR6	, TWAM6	; For compatibility

; TWBR - TWI Bit Rate register
.equ	TWBR0	, 0	; 
.equ	TWBR1	, 1	; 
.equ	TWBR2	, 2	; 
.equ	TWBR3	, 3	; 
.equ	TWBR4	, 4	; 
.equ	TWBR5	, 5	; 
.equ	TWBR6	, 6	; 
.equ	TWBR7	, 7	; 

; TWCR - TWI Control Register
.equ	TWIE	, 0	; TWI Interrupt Enable
.equ	TWEN	, 2	; TWI Enable Bit
.equ	TWWC	, 3	; TWI Write Collition Flag
.equ	TWSTO	, 4	; TWI Stop Condition Bit
.equ	TWSTA	, 5	; TWI Start Condition Bit
.equ	TWEA	, 6	; TWI Enable Acknowledge Bit
.equ	TWINT	, 7	; TWI Interrupt Flag

; TWSR - TWI Status Register
.equ	TWPS0	, 0	; TWI Prescaler
.equ	TWPS1	, 1	; TWI Prescaler
.equ	TWS3	, 3	; TWI Status
.equ	TWS4	, 4	; TWI Status
.equ	TWS5	, 5	; TWI Status
.equ	TWS6	, 6	; TWI Status
.equ	TWS7	, 7	; TWI Status

; TWDR - TWI Data register
.equ	TWD0	, 0	; TWI Data Register Bit 0
.equ	TWD1	, 1	; TWI Data Register Bit 1
.equ	TWD2	, 2	; TWI Data Register Bit 2
.equ	TWD3	, 3	; TWI Data Register Bit 3
.equ	TWD4	, 4	; TWI Data Register Bit 4
.equ	TWD5	, 5	; TWI Data Register Bit 5
.equ	TWD6	, 6	; TWI Data Register Bit 6
.equ	TWD7	, 7	; TWI Data Register Bit 7

; TWAR - TWI (Slave) Address register
.equ	TWGCE	, 0	; TWI General Call Recognition Enable Bit
.equ	TWA0	, 1	; TWI (Slave) Address register Bit 0
.equ	TWA1	, 2	; TWI (Slave) Address register Bit 1
.equ	TWA2	, 3	; TWI (Slave) Address register Bit 2
.equ	TWA3	, 4	; TWI (Slave) Address register Bit 3
.equ	TWA4	, 5	; TWI (Slave) Address register Bit 4
.equ	TWA5	, 6	; TWI (Slave) Address register Bit 5
.equ	TWA6	, 7	; TWI (Slave) Address register Bit 6


; ***** USART1 ***********************
; UDR1 - USART I/O Data Register
.equ	UDR1_0	, 0	; USART I/O Data Register bit 0
.equ	UDR1_1	, 1	; USART I/O Data Register bit 1
.equ	UDR1_2	, 2	; USART I/O Data Register bit 2
.equ	UDR1_3	, 3	; USART I/O Data Register bit 3
.equ	UDR1_4	, 4	; USART I/O Data Register bit 4
.equ	UDR1_5	, 5	; USART I/O Data Register bit 5
.equ	UDR1_6	, 6	; USART I/O Data Register bit 6
.equ	UDR1_7	, 7	; USART I/O Data Register bit 7

; UCSR1A - USART Control and Status Register A
.equ	MPCM1	, 0	; Multi-processor Communication Mode
.equ	U2X1	, 1	; Double the USART transmission speed
.equ	UPE1	, 2	; Parity Error
.equ	DOR1	, 3	; Data overRun
.equ	FE1	, 4	; Framing Error
.equ	UDRE1	, 5	; USART Data Register Empty
.equ	TXC1	, 6	; USART Transmitt Complete
.equ	RXC1	, 7	; USART Receive Complete

; UCSR1B - USART Control and Status Register B
.equ	TXB81	, 0	; Transmit Data Bit 8
.equ	RXB81	, 1	; Receive Data Bit 8
.equ	UCSZ12	, 2	; Character Size
.equ	TXEN1	, 3	; Transmitter Enable
.equ	RXEN1	, 4	; Receiver Enable
.equ	UDRIE1	, 5	; USART Data register Empty Interrupt Enable
.equ	TXCIE1	, 6	; TX Complete Interrupt Enable
.equ	RXCIE1	, 7	; RX Complete Interrupt Enable

; UCSR1C - USART Control and Status Register C
.equ	UCPOL1	, 0	; Clock Polarity
.equ	UCSZ10	, 1	; Character Size
.equ	UCPHA1	, UCSZ10	; For compatibility
.equ	UCSZ11	, 2	; Character Size
.equ	UDORD1	, UCSZ11	; For compatibility
.equ	USBS1	, 3	; Stop Bit Select
.equ	UPM10	, 4	; Parity Mode Bit 0
.equ	UPM11	, 5	; Parity Mode Bit 1
.equ	UMSEL10	, 6	; USART Mode Select
.equ	UMSEL11	, 7	; USART Mode Select

; UBRR1H - USART Baud Rate Register High Byte
.equ	UBRR_8	, 0	; USART Baud Rate Register bit 8
.equ	UBRR_9	, 1	; USART Baud Rate Register bit 9
.equ	UBRR_10	, 2	; USART Baud Rate Register bit 10
.equ	UBRR_11	, 3	; USART Baud Rate Register bit 11

; UBRR1L - USART Baud Rate Register Low Byte
.equ	UBRR_0	, 0	; USART Baud Rate Register bit 0
.equ	UBRR_1	, 1	; USART Baud Rate Register bit 1
.equ	UBRR_2	, 2	; USART Baud Rate Register bit 2
.equ	UBRR_3	, 3	; USART Baud Rate Register bit 3
.equ	UBRR_4	, 4	; USART Baud Rate Register bit 4
.equ	UBRR_5	, 5	; USART Baud Rate Register bit 5
.equ	UBRR_6	, 6	; USART Baud Rate Register bit 6
.equ	UBRR_7	, 7	; USART Baud Rate Register bit 7


