Scaniox/il-flatto/bootloader/re-linked/part_defs/atmega1284pdef.inc
; ***** SPI **************************
; SPDR - SPI Data Register
.equ	SPDR0	, 0	; SPI Data Register bit 0
.equ	SPDR1	, 1	; SPI Data Register bit 1
.equ	SPDR2	, 2	; SPI Data Register bit 2
.equ	SPDR3	, 3	; SPI Data Register bit 3
.equ	SPDR4	, 4	; SPI Data Register bit 4
.equ	SPDR5	, 5	; SPI Data Register bit 5
.equ	SPDR6	, 6	; SPI Data Register bit 6
.equ	SPDR7	, 7	; SPI Data Register bit 7

; SPSR - SPI Status Register
.equ	SPI2X	, 0	; Double SPI Speed Bit
.equ	WCOL	, 6	; Write Collision Flag
.equ	SPIF	, 7	; SPI Interrupt Flag

; SPCR - SPI Control Register
.equ	SPR0	, 0	; SPI Clock Rate Select 0
.equ	SPR1	, 1	; SPI Clock Rate Select 1
.equ	CPHA	, 2	; Clock Phase
.equ	CPOL	, 3	; Clock polarity
.equ	MSTR	, 4	; Master/Slave Select
.equ	DORD	, 5	; Data Order
.equ	SPE	, 6	; SPI Enable
.equ	SPIE	, 7	; SPI Interrupt Enable


; ***** WATCHDOG *********************
; WDTCSR - Watchdog Timer Control Register
.equ	WDP0	, 0	; Watch Dog Timer Prescaler bit 0
.equ	WDP1	, 1	; Watch Dog Timer Prescaler bit 1
.equ	WDP2	, 2	; Watch Dog Timer Prescaler bit 2
.equ	WDE	, 3	; Watch Dog Enable
.equ	WDCE	, 4	; Watchdog Change Enable
.equ	WDP3	, 5	; Watchdog Timer Prescaler Bit 3
.equ	WDIE	, 6	; Watchdog Timeout Interrupt Enable
.equ	WDIF	, 7	; Watchdog Timeout Interrupt Flag


; ***** CPU **************************
; SREG - Status Register
.equ	SREG_C	, 0	; Carry Flag
.equ	SREG_Z	, 1	; Zero Flag
.equ	SREG_N	, 2	; Negative Flag
.equ	SREG_V	, 3	; Two's Complement Overflow Flag
.equ	SREG_S	, 4	; Sign Bit
.equ	SREG_H	, 5	; Half Carry Flag
.equ	SREG_T	, 6	; Bit Copy Storage
.equ	SREG_I	, 7	; Global Interrupt Enable

; MCUCR - MCU Control Register
.equ	IVCE	, 0	; Interrupt Vector Change Enable
.equ	IVSEL	, 1	; Interrupt Vector Select
.equ	PUD	, 4	; Pull-up disable
.equ	BODSE	, 5	; BOD Power Down in Sleep Enable
.equ	BODS	, 6	; BOD Power Down in Sleep
;.equ	JTD	, 7	; JTAG Interface Disable

; MCUSR - MCU Status Register
.equ	PORF	, 0	; Power-on reset flag
.equ	EXTRF	, 1	; External Reset Flag
.equ	BORF	, 2	; Brown-out Reset Flag
.equ	WDRF	, 3	; Watchdog Reset Flag
;.equ	JTRF	, 4	; JTAG Reset Flag

; OSCCAL - Oscillator Calibration Value
.equ	CAL0	, 0	; Oscillator Calibration Value Bit0
.equ	CAL1	, 1	; Oscillator Calibration Value Bit1
.equ	CAL2	, 2	; Oscillator Calibration Value Bit2
.equ	CAL3	, 3	; Oscillator Calibration Value Bit3
.equ	CAL4	, 4	; Oscillator Calibration Value Bit4
.equ	CAL5	, 5	; Oscillator Calibration Value Bit5
.equ	CAL6	, 6	; Oscillator Calibration Value Bit6
.equ	CAL7	, 7	; Oscillator Calibration Value Bit7

; CLKPR - 
.equ	CLKPS0	, 0	; 
.equ	CLKPS1	, 1	; 
.equ	CLKPS2	, 2	; 
.equ	CLKPS3	, 3	; 
.equ	CLKPCE	, 7	; 

; SMCR - Sleep Mode Control Register
.equ	SE	, 0	; Sleep Enable
.equ	SM0	, 1	; Sleep Mode Select bit 0
.equ	SM1	, 2	; Sleep Mode Select bit 1
.equ	SM2	, 3	; Sleep Mode Select bit 2

; RAMPZ - RAM Page Z Select Register
.equ	RAMPZ0	, 0	; RAM Page Z Select Register Bit 0

; GPIOR2 - General Purpose IO Register 2
.equ	GPIOR20	, 0	; General Purpose IO Register 2 bit 0
.equ	GPIOR21	, 1	; General Purpose IO Register 2 bit 1
.equ	GPIOR22	, 2	; General Purpose IO Register 2 bit 2
.equ	GPIOR23	, 3	; General Purpose IO Register 2 bit 3
.equ	GPIOR24	, 4	; General Purpose IO Register 2 bit 4
.equ	GPIOR25	, 5	; General Purpose IO Register 2 bit 5
.equ	GPIOR26	, 6	; General Purpose IO Register 2 bit 6
.equ	GPIOR27	, 7	; General Purpose IO Register 2 bit 7

; GPIOR1 - General Purpose IO Register 1
.equ	GPIOR10	, 0	; General Purpose IO Register 1 bit 0
.equ	GPIOR11	, 1	; General Purpose IO Register 1 bit 1
.equ	GPIOR12	, 2	; General Purpose IO Register 1 bit 2
.equ	GPIOR13	, 3	; General Purpose IO Register 1 bit 3
.equ	GPIOR14	, 4	; General Purpose IO Register 1 bit 4
.equ	GPIOR15	, 5	; General Purpose IO Register 1 bit 5
.equ	GPIOR16	, 6	; General Purpose IO Register 1 bit 6
.equ	GPIOR17	, 7	; General Purpose IO Register 1 bit 7

; GPIOR0 - General Purpose IO Register 0
.equ	GPIOR00	, 0	; General Purpose IO Register 0 bit 0
.equ	GPIOR01	, 1	; General Purpose IO Register 0 bit 1
.equ	GPIOR02	, 2	; General Purpose IO Register 0 bit 2
.equ	GPIOR03	, 3	; General Purpose IO Register 0 bit 3
.equ	GPIOR04	, 4	; General Purpose IO Register 0 bit 4
.equ	GPIOR05	, 5	; General Purpose IO Register 0 bit 5
.equ	GPIOR06	, 6	; General Purpose IO Register 0 bit 6
.equ	GPIOR07	, 7	; General Purpose IO Register 0 bit 7

; PRR0 - Power Reduction Register0
.equ	PRADC	, 0	; Power Reduction ADC
.equ	PRUSART0	, 1	; Power Reduction USART 0
.equ	PRSPI	, 2	; Power Reduction Serial Peripheral Interface
.equ	PRTIM1	, 3	; Power Reduction Timer/Counter1
.equ	PRUSART1	, 4	; Power Reduction USART 1
.equ	PRTIM0	, 5	; Power Reduction Timer/Counter0
.equ	PRTIM2	, 6	; Power Reduction Timer/Counter2
.equ	PRTWI	, 7	; Power Reduction TWI

; PRR1 - Power Reduction Register1
.equ	PRTIM3	, 0	; Power Reduction Timer/Counter3



; ***** LOCKSBITS ********************************************************
.equ	LB1	, 0	; Lock bit
.equ	LB2	, 1	; Lock bit
.equ	BLB01	, 2	; Boot Lock bit
.equ	BLB02	, 3	; Boot Lock bit
.equ	BLB11	, 4	; Boot lock bit
.equ	BLB12	, 5	; Boot lock bit


; ***** FUSES ************************************************************
; LOW fuse bits
.equ	CKSEL0	, 0	; Select Clock Source
.equ	CKSEL1	, 1	; Select Clock Source
.equ	CKSEL2	, 2	; Select Clock Source
.equ	CKSEL3	, 3	; Select Clock Source
.equ	SUT0	, 4	; Select start-up time
.equ	SUT1	, 5	; Select start-up time
.equ	CKOUT	, 6	; Clock output
.equ	CKDIV8	, 7	; Divide clock by 8

; HIGH fuse bits
.equ	BOOTRST	, 0	; Select Reset Vector
.equ	BOOTSZ0	, 1	; Select Boot Size
.equ	BOOTSZ1	, 2	; Select Boot Size
.equ	EESAVE	, 3	; EEPROM memory is preserved through chip erase
.equ	WDTON	, 4	; Watchdog timer always on
.equ	SPIEN	, 5	; Enable Serial programming and Data Downloading
.equ	JTAGEN	, 6	; Enable JTAG
.equ	OCDEN	, 7	; Enable OCD

; EXTENDED fuse bits
.equ	BODLEVEL0	, 0	; Brown-out Detector trigger level
.equ	BODLEVEL1	, 1	; Brown-out Detector trigger level
.equ	BODLEVEL2	, 2	; Brown-out Detector trigger level



; ***** CPU REGISTER DEFINITIONS *****************************************
.equ	XH	, r27
.equ	XL	, r26
.equ	YH	, r29
.equ	YL	, r28
.equ	ZH	, r31
.equ	ZL	, r30



; ***** DATA MEMORY DECLARATIONS *****************************************
.equ	FLASHEND	, 0xffff	; Note: Word address
.equ	IOEND	, 0x00ff
.equ	SRAM_START	, 0x0100
.equ	SRAM_SIZE	, 16384
.equ	RAMEND	, 0x40ff
.equ	XRAMEND	, 0x0000
.equ	E2END	, 0x0fff
.equ	EEPROMEND	, 0x0fff
.equ	EEADRBITS	, 12
#pragma AVRPART MEMORY PROG_FLASH 131072
#pragma AVRPART MEMORY EEPROM 4096
#pragma AVRPART MEMORY INT_SRAM SIZE 16384
#pragma AVRPART MEMORY INT_SRAM START_ADDR 0x100



; ***** BOOTLOADER DECLARATIONS ******************************************
.equ	NRWW_START_ADDR	, 0xf000
.equ	NRWW_STOP_ADDR	, 0xffff
.equ	RWW_START_ADDR	, 0x0
.equ	RWW_STOP_ADDR	, 0xefff
.equ	PAGESIZE	, 128
.equ	FIRSTBOOTSTART	, 0xfe00
.equ	SECONDBOOTSTART	, 0xfc00
.equ	THIRDBOOTSTART	, 0xf800
.equ	FOURTHBOOTSTART	, 0xf000
.equ	SMALLBOOTSTART	, FIRSTBOOTSTART
.equ	LARGEBOOTSTART	, FOURTHBOOTSTART



; ***** INTERRUPT VECTORS ************************************************
.equ	INT0addr	, 0x0002	; External Interrupt Request 0
.equ	INT1addr	, 0x0004	; External Interrupt Request 1
.equ	INT2addr	, 0x0006	; External Interrupt Request 2
.equ	PCI0addr	, 0x0008	; Pin Change Interrupt Request 0
.equ	PCI1addr	, 0x000a	; Pin Change Interrupt Request 1
.equ	PCI2addr	, 0x000c	; Pin Change Interrupt Request 2
.equ	PCI3addr	, 0x000e	; Pin Change Interrupt Request 3
.equ	WDTaddr	, 0x0010	; Watchdog Time-out Interrupt
.equ	OC2Aaddr	, 0x0012	; Timer/Counter2 Compare Match A
.equ	OC2Baddr	, 0x0014	; Timer/Counter2 Compare Match B
.equ	OVF2addr	, 0x0016	; Timer/Counter2 Overflow
.equ	ICP1addr	, 0x0018	; Timer/Counter1 Capture Event
.equ	OC1Aaddr	, 0x001a	; Timer/Counter1 Compare Match A
.equ	OC1Baddr	, 0x001c	; Timer/Counter1 Compare Match B
.equ	OVF1addr	, 0x001e	; Timer/Counter1 Overflow
.equ	OC0Aaddr	, 0x0020	; Timer/Counter0 Compare Match A
.equ	OC0Baddr	, 0x0022	; Timer/Counter0 Compare Match B
.equ	OVF0addr	, 0x0024	; Timer/Counter0 Overflow
.equ	SPIaddr	, 0x0026	; SPI Serial Transfer Complete
.equ	URXC0addr	, 0x0028	; USART0, Rx Complete
.equ	UDRE0addr	, 0x002a	; USART0 Data register Empty
.equ	UTXC0addr	, 0x002c	; USART0, Tx Complete
.equ	ACIaddr	, 0x002e	; Analog Comparator
.equ	ADCCaddr	, 0x0030	; ADC Conversion Complete
.equ	ERDYaddr	, 0x0032	; EEPROM Ready
.equ	TWIaddr	, 0x0034	; 2-wire Serial Interface
.equ	SPMRaddr	, 0x0036	; Store Program Memory Read
.equ	URXC1addr	, 0x0038	; USART1 RX complete
.equ	UDRE1addr	, 0x003a	; USART1 Data Register Empty
.equ	UTXC1addr	, 0x003c	; USART1 TX complete
.equ	ICP3addr	, 0x003e	; Timer/Counter3 Capture Event
.equ	OC3Aaddr	, 0x0040	; Timer/Counter3 Compare Match A
.equ	OC3Baddr	, 0x0042	; Timer/Counter3 Compare Match B
.equ	OVF3addr	, 0x0044	; Timer/Counter3 Overflow

.equ	INT_VECTORS_SIZE	, 70	; size in words

#endif  /* _M1284PDEF_INC_ */

; ***** END OF FILE ******************************************************
